src/Catalogs/кфкТипыДанныхСпецификации/кфкТипыДанныхСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>кфкТипыДанныхСпецификации</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.кфкСпецификации</owners>
  <attributes>
    <name>Описание</name>
    <comment>description</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДанных</name>
    <comment>type</comment>
    <type>
      <types>CatalogRef.кфкТипыЗначенийСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматДанных</name>
    <comment>format</comment>
    <type>
      <types>CatalogRef.кфкТипыЗначенийСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>Минимум</name>
    <comment>minimum|minLength|minItems</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>31</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Максимум</name>
    <comment>maximum|maxLength|maxItems</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>31</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Перечисление</name>
    <comment>enum</comment>
    <type>
      <types>CatalogRef.кфкПеречисленияСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>РегулярноеВыражение</name>
    <comment>pattern</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Устарело</name>
    <comment>deprecated</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Обязательное</name>
    <comment>required</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПоУмолчанию</name>
    <comment>default</comment>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>31</precision>
        <scale>4</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектКонфигурации</name>
    <type>
      <types>CatalogRef.Свойства</types>
      <types>CatalogRef.Объекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>БазовыеТипы</name>
    <comment>$ref|allOf</comment>
    <attributes>
      <name>Тип</name>
      <type>
        <types>CatalogRef.кфкТипыДанныхСпецификации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/кфкТипыЗначенийСпецификации/кфкТипыЗначенийСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>кфкТипыЗначенийСпецификации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Строка</name>
      <description>Строка</description>
    </items>
    <items>
      <name>Число</name>
      <description>Число</description>
    </items>
    <items>
      <name>ЦелоеЧисло</name>
      <description>Целое число</description>
    </items>
    <items>
      <name>Логический</name>
      <description>Логический</description>
    </items>
    <items>
      <name>Массив</name>
      <description>Массив</description>
    </items>
    <items>
      <name>Структура</name>
      <description>Структура</description>
    </items>
  </predefined>
</mdclass:Catalog>

src/Catalogs/кфкКаналыСпецификации/кфкКаналыСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>кфкКаналыСпецификации</name>
  <owners>Catalog.кфкСпецификации</owners>
  <attributes>
    <name>ТипДанных</name>
    <type>
      <types>CatalogRef.кфкТипыДанныхСпецификации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Получатели</name>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.кфкПриложенияСпецификаций</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/кфкТипыДанныхСпецификации/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоНовый = Объект.Ссылка.Пустая();
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПримерыСообщений, "Владелец", Объект.Ссылка);
	
	БазовыеТипы.ЗагрузитьЗначения(ОбщегоНазначения.ВыгрузитьКолонку(Объект.БазовыеТипы, "Тип"));
	
	Если Объект.Родитель.Пустая() И Объект.ТипДанных.Пустая()  Тогда
		Объект.ТипДанных = Справочники.кфкТипыЗначенийСпецификации.Структура;
	КонецЕсли;
	
	РелизКонфигурации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Владелец, "ПравилаОбмена.Конфигурация");
	
	Если Не ЭтоНовый И Объект.ТипДанных = Справочники.кфкТипыЗначенийСпецификации.Массив Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Справочник.кфкТипыДанныхСпецификации.Ссылка
		|ГДЕ Родитель = &Ссылка УПОРЯДОЧИТЬ ПО ПометкаУдаления";
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ТипЭлементаМассива = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьСвойстваРодителя();
	
	Элементы.ОбъектКонфигурации.Заголовок = ?(Объект.Родитель.Пустая(),
		НСтр("ru = 'Объект 1С'"), НСтр("ru = 'Свойство 1С'"));
	
	ЭтоТабличнаяЧасть = Объект.Родитель.Пустая() И ТипЗнч(Объект.ОбъектКонфигурации) = Тип("СправочникСсылка.Свойства");
	Если ЭтоТабличнаяЧасть Тогда
		Элементы.ОбъектКонфигурации.Подсказка = ПредставлениеВладельцаТЧ(Объект.ОбъектКонфигурации);
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступность();
	
	ОбновитьЗаголовок();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.БазовыеТипы.Очистить();
	
	Список = БазовыеТипы.Скопировать();
	Список.СортироватьПоЗначению();
	Для Каждого Получатель Из ОбщегоНазначения.ВыгрузитьКолонку(Список, "Значение", Истина) Цикл
		ТекущийОбъект.БазовыеТипы.Добавить().Получатель = Получатель;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПримерыСообщений, "Владелец", Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ЭтоНовый И Объект.Родитель.Пустая()
			И Объект.ТипДанных = ПредопределенноеЗначение("Справочник.кфкТипыЗначенийСпецификации.Структура") Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("СоздатьКаналСпецификации", ЭтотОбъект),
			НСтр("ru = 'Создать канал спецификации?'"), РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
	ЭтоНовый = Объект.Ссылка.Пустая();
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив; // Массив Из Строка
	
	Если Объект.ТипДанных <> Справочники.кфкТипыЗначенийСпецификации.Массив Или ЭтоНовый Тогда
		
		НепроверяемыеРеквизиты.Добавить("ТипЭлементаМассива");
		
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОбновитьДеревоПолей();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Если ТипЗнч(НовыйОбъект) = Тип("СправочникСсылка.кфкТипыДанныхСпецификации") Тогда
		СтандартнаяОбработка = Ложь;
		Строки = ДеревоПолей.ПолучитьЭлементы();
		Строка = Строки.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, ОписаниеТипа(НовыйОбъект));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	ОбновитьЗаголовок();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипДанныхПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
	Если Объект.ТипДанных = ПредопределенноеЗначение("Справочник.кфкТипыЗначенийСпецификации.Структура") Тогда
		ОбновитьДеревоПолей();
	КонецЕсли;
	
	ОбновитьЗаголовок();
	
КонецПроцедуры

&НаКлиенте
Процедура ФорматДанныхПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеречислениеПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектКонфигурацииНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПростыеТипы = Новый Массив;
	ПростыеТипы.Добавить(ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.кфкТипыЗначенийСпецификации.Строка"));
	ПростыеТипы.Добавить(ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.кфкТипыЗначенийСпецификации.Число"));
	ПростыеТипы.Добавить(ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.кфкТипыЗначенийСпецификации.ЦелоеЧисло"));
	ПростыеТипы.Добавить(ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.кфкТипыЗначенийСпецификации.Логический"));
	
	Если Объект.Родитель.Пустая()
		И Объект.ТипДанных = ПредопределенноеЗначение("Справочник.кфкТипыЗначенийСпецификации.Структура") Тогда
		ПараметрыФормыВыбора = Новый Структура;
		ПараметрыФормыВыбора.Вставить("ДляПКО", Истина);
		ПараметрыФормыВыбора.Вставить("РежимРаботы", "ОбъектКонфигурации");
		ПараметрыФормыВыбора.Вставить("ТекущаяСтрока", Объект.ОбъектКонфигурации);
		ПараметрыФормыВыбора.Вставить("ВедущаяКонфигурация", РелизКонфигурации);
		ПараметрыФормыВыбора.Вставить("МассивКонфигураций", Новый СписокЗначений);
		
	ИначеЕсли Не Объект.Родитель.Пустая() И ПростыеТипы.Найти(Объект.ТипДанных) <> Неопределено Тогда
		ПараметрыФормыВыбора = Новый Структура;
		ПараметрыФормыВыбора.Вставить("РежимРаботы", "СвойствоКонфигурации");
		ПараметрыФормыВыбора.Вставить("ТекущаяСтрока", Объект.ОбъектКонфигурации);
		ПараметрыФормыВыбора.Вставить("ТаблицаСвойствКонфигурации", СвойстваКонфигурацииПоТипу(Объект.Родитель, Объект.ТипДанных));
		
	ИначеЕсли Не Объект.Родитель.Пустая()
		И Объект.ТипДанных = ПредопределенноеЗначение("Справочник.кфкТипыЗначенийСпецификации.Массив") Тогда
		ПараметрыФормыВыбора = Новый Структура;
		ПараметрыФормыВыбора.Вставить("РежимРаботы", "СвойствоКонфигурации");
		ПараметрыФормыВыбора.Вставить("ТекущаяСтрока", Объект.ОбъектКонфигурации);
		ПараметрыФормыВыбора.Вставить("ТаблицаСвойствКонфигурации", СвойстваКонфигурацииПоТипу(Объект.Родитель, Объект.ТипДанных));
		
	Иначе
		Возврат;
		
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.ВыборОбъектаИлиСвойства", ПараметрыФормыВыбора, ЭтотОбъект, , , ,
		Новый ОписаниеОповещения("ОбъектКонфигурацииВыборЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтоТабличнаяЧастьПриИзменении(Элемент)
	
	Объект.ОбъектКонфигурации = Неопределено;
	Элементы.ОбъектКонфигурации.Подсказка = "";
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Объект.Описание, ЭтотОбъект, "Объект.Описание",
		НСтр("ru = 'Описание'"));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоПолей

&НаКлиенте
Процедура ДеревоПолейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Строка = ДеревоПолей.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.кфкТипыДанныхСпецификации.ФормаОбъекта", Новый Структура("Ключ", Строка.Ссылка),
		ЭтотОбъект, , , , Новый ОписаниеОповещения("ДеревоПолейЗавершениеРедактирования", ЭтотОбъект, ВыбраннаяСтрока),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоляСоздать(Команда)
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Владелец", Объект.Владелец);
	ЗначенияЗаполнения.Вставить("Родитель", Объект.Ссылка);
	ОткрытьФорму("Справочник.кфкТипыДанныхСпецификации.ФормаОбъекта",
		Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения), ЭтотОбъект, , , , ,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляПодобрать(Команда)
	
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("ТипДанных", Объект.Ссылка);
	ПараметрыПодбора.Вставить("Спецификация", Объект.Владелец);
	ПараметрыПодбора.Вставить("РелизКонфигурации", РелизКонфигурации);
	Если Не Объект.Родитель.Пустая() И ЗначениеЗаполнено(СвойстваРодителя.ОбъектКонфигурации)
			И СвойстваРодителя.ТипДанных = ПредопределенноеЗначение("Справочник.кфкТипыЗначенийСпецификации.Массив") Тогда
		ПараметрыПодбора.Вставить("ОбъектКонфигурации", СвойстваРодителя.ОбъектКонфигурации);
	Иначе
		ПараметрыПодбора.Вставить("ОбъектКонфигурации", Объект.ОбъектКонфигурации);
	КонецЕсли;
	ОткрытьФорму("Справочник.кфкТипыДанныхСпецификации.Форма.ФормаПодбораПолей", ПараметрыПодбора, ЭтотОбъект,
		, , , Новый ОписаниеОповещения("ПодобратьПоляЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляИзменить(Команда)
	
	ТекущиеДанные = Элементы.ДеревоПолей.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.кфкТипыДанныхСпецификации.ФормаОбъекта", Новый Структура("Ключ", ТекущиеДанные.Ссылка),
		ЭтотОбъект, , , ,
		Новый ОписаниеОповещения("ДеревоПолейЗавершениеРедактирования", ЭтотОбъект, Элементы.ДеревоПолей.ТекущаяСтрока),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляПометитьНаУдаление(Команда)
	
	ТекущиеДанные = Элементы.ДеревоПолей.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИзменитьПометкуУдаления(ТекущиеДанные.Ссылка, Не ТекущиеДанные.ПометкаУдаления);
	
	ТекущиеДанные.ПометкаУдаления = Не ТекущиеДанные.ПометкаУдаления;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляОбновить(Команда)
	
	ОбновитьДеревоПолей();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляИсторияДанных(Команда)
	
	ТекущиеДанные = Элементы.ДеревоПолей.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.кфкDataHistoryVersions", Новый Структура("Data", ТекущиеДанные.Ссылка), ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПоляПолучитьНавигационнуюСсылку(Команда)
	
	ТекущиеДанные = Элементы.ДеревоПолей.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(ТекущиеДанные.Ссылка);
	ЭлементБуфера = Новый ЭлементБуфераОбмена(СтандартныйФорматДанныхБуфераОбмена.Текст, НавигационнаяСсылка);
	Ждать СредстваБуфераОбмена.ПоместитьДанныеАсинх(ЭлементБуфера);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	
	// Сбрасываем видимость и доступность
	
	// Описание
	Элементы.ГруппаОсновноеОписаниеКодИмя.Доступность = Истина;
	Элементы.Описание.Видимость = Истина;
	// Тип
	Элементы.ТипЭлементаМассива.Видимость = Ложь;
	Элементы.ТипЭлементаМассива.Доступность = Не ЭтоНовый;
	Элементы.ФорматДанных.Видимость = Ложь;
	Элементы.ФорматДанных.Доступность = Объект.Перечисление.Пустая();
	Элементы.БазовыеТипы.Видимость = Ложь;
	// Ограничения
	Элементы.ГруппаОсновноеОграничения.Доступность = Объект.Перечисление.Пустая();
	Элементы.ГруппаОсновноеОграниченияМинМакс.Видимость = Ложь;
	Элементы.Перечисление.Видимость = Ложь;
	Элементы.Перечисление.Доступность = Объект.ФорматДанных.Пустая();
	Элементы.РегулярноеВыражение.Видимость = Ложь;
	// Дополнительные свойства
	Элементы.Обязательное.Видимость = Ложь;
	Элементы.ЗначениеПоУмолчанию.Видимость = Ложь;
//	Элементы.ОбъектКонфигурации.Видимость = Ложь;
	Элементы.ЭтоТабличнаяЧасть.Видимость = Истина;
	Элементы.СтраницаПоля.Видимость = Ложь;
	Элементы.СтраницаПоля.Доступность = Не ЭтоНовый;
	Элементы.СтраницаПримеры.Доступность = Не ЭтоНовый;
	// Команды
	Элементы.ФормаСправочниккфкКаналыСпецификацииКаналСпецификации.Видимость = Ложь;
	
	// Устанавливаем видимость и доступность
	
	//@skip-check bsl-legacy-check-string-literal
	Если Объект.ТипДанных = ПредопределенноеЗначение("Справочник.кфкТипыЗначенийСпецификации.Структура") Тогда
		// Тип
		Элементы.БазовыеТипы.Видимость = Истина;
		// Дополнительные свойства
		Элементы.Обязательное.Видимость = Не Объект.Родитель.Пустая(); // Вложенное поле может быть обязательным
		Элементы.ОбъектКонфигурации.Видимость = Объект.Родитель.Пустая();
		Элементы.ЭтоТабличнаяЧасть.Видимость = Объект.Родитель.Пустая();
		Элементы.ОбъектКонфигурации.ОграничениеТипа = ?(ЭтоТабличнаяЧасть,
			Новый ОписаниеТипов("СправочникСсылка.Свойства"), Новый ОписаниеТипов("СправочникСсылка.Объекты"));
		Элементы.СтраницаПоля.Видимость = Истина;
		// Команды
		Элементы.ФормаСправочниккфкКаналыСпецификацииКаналСпецификации.Видимость = Истина;
		
	ИначеЕсли Объект.ТипДанных = ПредопределенноеЗначение("Справочник.кфкТипыЗначенийСпецификации.Массив") Тогда
		// Тип
		Элементы.ТипЭлементаМассива.Видимость = Истина;
		// Ограничения
		Элементы.ГруппаОсновноеОграниченияМинМакс.Видимость = Истина;
		Элементы.ОбъектКонфигурации.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Свойства");
		
	ИначеЕсли Объект.ТипДанных = ПредопределенноеЗначение("Справочник.кфкТипыЗначенийСпецификации.Строка") Тогда
		// Тип
		Элементы.ФорматДанных.Видимость = Истина;
		// Ограничения
		Элементы.ГруппаОсновноеОграниченияМинМакс.Видимость = Объект.ФорматДанных.Пустая()
			Или Объект.ФорматДанных = ПредопределенноеЗначение("Справочник.кфкТипыЗначенийСпецификации.АдресРесурса")
			Или Объект.ФорматДанных = ПредопределенноеЗначение("Справочник.кфкТипыЗначенийСпецификации.ЭлектроннаяПочта");
		Элементы.Перечисление.Видимость = Истина;
		Элементы.РегулярноеВыражение.Видимость = Истина;
		// Дополнительные свойства
		Элементы.Обязательное.Видимость = Истина;
		Элементы.ЗначениеПоУмолчанию.Видимость = Истина;
		Элементы.ЗначениеПоУмолчанию.ОграничениеТипа = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(Объект.Максимум));
		Элементы.ОбъектКонфигурации.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Свойства");
		
	ИначеЕсли Объект.ТипДанных = ПредопределенноеЗначение("Справочник.кфкТипыЗначенийСпецификации.Число") Тогда
		// Тип
		Элементы.ФорматДанных.Видимость = Истина;
		// Ограничения
		Элементы.ГруппаОсновноеОграниченияМинМакс.Видимость = Истина;
		Элементы.Перечисление.Видимость = Истина;
		// Дополнительные свойства
		Элементы.Обязательное.Видимость = Истина;
		Элементы.ЗначениеПоУмолчанию.Видимость = Истина;
		Элементы.ЗначениеПоУмолчанию.ОграничениеТипа = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(Объект.Максимум+4, 4, ДопустимыйЗнак.Любой));
		Элементы.ОбъектКонфигурации.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Свойства");
		
	ИначеЕсли Объект.ТипДанных = ПредопределенноеЗначение("Справочник.кфкТипыЗначенийСпецификации.ЦелоеЧисло") Тогда
		// Тип
		Элементы.ФорматДанных.Видимость = Истина;
		// Ограничения
		Элементы.ГруппаОсновноеОграниченияМинМакс.Видимость = Истина;
		Элементы.Перечисление.Видимость = Истина;
		// Дополнительные свойства
		Элементы.Обязательное.Видимость = Истина;
		Элементы.ЗначениеПоУмолчанию.Видимость = Истина;
		Элементы.ЗначениеПоУмолчанию.ОграничениеТипа = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(Объект.Максимум, 0, ДопустимыйЗнак.Любой));
		Элементы.ОбъектКонфигурации.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Свойства");
		
	ИначеЕсли Объект.ТипДанных = ПредопределенноеЗначение("Справочник.кфкТипыЗначенийСпецификации.Логический") Тогда
		// Дополнительные свойства
		Элементы.Обязательное.Видимость = Истина;
		Элементы.ЗначениеПоУмолчанию.Видимость = Истина;
		Элементы.ЗначениеПоУмолчанию.ОграничениеТипа = Новый ОписаниеТипов("Булево");
		Элементы.ОбъектКонфигурации.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Свойства");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовок()
	
	Если Объект.Родитель.Пустая()
		И Объект.ТипДанных = ПредопределенноеЗначение("Справочник.кфкТипыЗначенийСпецификации.Структура") Тогда
		ШаблонЗаголовка = НСтр("ru = 'Тип данных:'");
		
	ИначеЕсли Объект.Родитель.Пустая() Тогда
		ШаблонЗаголовка = НСтр("ru = 'Шаблон:'");
		
	ИначеЕсли Объект.ТипДанных = ПредопределенноеЗначение("Справочник.кфкТипыЗначенийСпецификации.Структура") Тогда
		ШаблонЗаголовка = НСтр("ru = 'Объект:'");
		
	ИначеЕсли Объект.ТипДанных = ПредопределенноеЗначение("Справочник.кфкТипыЗначенийСпецификации.Массив") Тогда
		ШаблонЗаголовка = НСтр("ru = 'Массив:'");
		
	Иначе
		ШаблонЗаголовка = НСтр("ru = 'Поле:'");
		
	КонецЕсли;
	
	Если ПустаяСтрока(Объект.Код) И ПустаяСтрока(Объект.Наименование) Тогда
		Заголовок = ШаблонЗаголовка + НСтр("ru = ' <код/наименование>'");
		
	ИначеЕсли ПустаяСтрока(Объект.Код) Тогда
		Заголовок = ШаблонЗаголовка + " " + Объект.Код;
		
	ИначеЕсли ПустаяСтрока(Объект.Наименование) Тогда
		Заголовок = ШаблонЗаголовка + " " + Объект.Наименование;
		
	Иначе
		Заголовок = ШаблонЗаголовка + " " + Объект.Код + " (" + Объект.Наименование + ")";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектКонфигурацииВыборЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоТабличнаяЧасть И ТипЗнч(Результат.Ссылка) = Тип("СправочникСсылка.Объекты") Тогда
		ПараметрыФормыВыбора = Новый Структура;
		ПараметрыФормыВыбора.Вставить("РежимРаботы", "СвойствоКонфигурации");
		ПараметрыФормыВыбора.Вставить("ТекущаяСтрока", Результат.Ссылка);
		ПараметрыФормыВыбора.Вставить("ТаблицаСвойствКонфигурации",
			СвойстваКонфигурации(Результат.Ссылка, "", Истина));
		ОткрытьФорму("ОбщаяФорма.ВыборОбъектаИлиСвойства", ПараметрыФормыВыбора, ЭтотОбъект, , , ,
			Новый ОписаниеОповещения("ОбъектКонфигурацииВыборЗавершение", ЭтотОбъект),
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли ЭтоТабличнаяЧасть Тогда
		Модифицированность = Истина;
		Объект.ОбъектКонфигурации = Результат.Ссылка;
		Элементы.ОбъектКонфигурации.Подсказка = ПредставлениеВладельцаТЧ(Объект.ОбъектКонфигурации);
		
	Иначе
		Модифицированность = Истина;
		Объект.ОбъектКонфигурации = Результат.Ссылка;
		Элементы.ОбъектКонфигурации.Подсказка = "";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьПоляЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Истина Тогда
		ОбновитьДеревоПолей();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПолейЗавершениеРедактирования(Результат, ИдентификаторСтроки) Экспорт
	
	Строка = ДеревоПолей.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Строка, ОписаниеТипа(Строка.Ссылка));
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКаналСпецификации(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
//		см. Справочники.кфкКаналыСпецификации.КаналСпецификации
		ОткрытьФорму("Справочник.кфкКаналыСпецификации.ФормаОбъекта", Новый Структура("Основание", Объект.Ссылка),
			ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОписаниеТипа(Ссылка)
	Возврат Справочники.кфкТипыДанныхСпецификации.ОписаниеТипа(Ссылка);
КонецФункции

&НаСервереБезКонтекста
Функция СвойстваКонфигурацииПоТипу(Родитель, ТипДанных)
	
	ЭтоГруппа = Ложь;
	РодительОбъектКонфигурации = "";
	
	Если ТипДанных = Справочники.кфкТипыЗначенийСпецификации.Массив Тогда
		ОбъектКонфигурации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Родитель, "ОбъектКонфигурации");
		ЭтоГруппа = Истина;
		
	Иначе
		Реквизиты = Новый Структура;
		Реквизиты.Вставить("ОбъектКонфигурации", "ОбъектКонфигурации");
		Реквизиты.Вставить("ТЧ_ТипДанных", "Родитель.ТипДанных");
		Реквизиты.Вставить("ТЧ_ОбъектКонфигурации", "Родитель.Родитель.ОбъектКонфигурации");
		Реквизиты.Вставить("ТЧ_Родитель", "Родитель.ОбъектКонфигурации");
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Родитель, Реквизиты);
		Если Реквизиты.ТЧ_ТипДанных = Справочники.кфкТипыЗначенийСпецификации.Массив Тогда
			ОбъектКонфигурации = Реквизиты.ТЧ_ОбъектКонфигурации;
			РодительОбъектКонфигурации = Реквизиты.ТЧ_Родитель;
			
		Иначе
			ОбъектКонфигурации = Реквизиты.ОбъектКонфигурации;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СвойстваКонфигурации(ОбъектКонфигурации, РодительОбъектКонфигурации, ЭтоГруппа);
			
КонецФункции

&НаСервереБезКонтекста
Функция СвойстваКонфигурации(ОбъектКонфигурации, Родитель = "", ЭтоГруппа = Ложь)
	
	Отбор = Новый Структура("Родитель,ЭтоГруппа", Родитель, ЭтоГруппа);
	Свойства = КонвертацияДанныхXDTOВызовСервера.ТаблицаСвойствОбъектаКонфигурации(ОбъектКонфигурации, Отбор);
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Свойства);
			
КонецФункции

&НаСервереБезКонтекста
Функция ПредставлениеВладельцаТЧ(ТабличнаяЧасть)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТабличнаяЧасть, "Владелец.Наименование");
КонецФункции

&НаСервереБезКонтекста
Процедура ИзменитьПометкуУдаления(Ссылка, ПометкаУдаления)
	
	Объект = Ссылка.ПолучитьОбъект();
	Объект.УстановитьПометкуУдаления(ПометкаУдаления);
	Объект.Записать();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Удаленные элементы
	ЭлементУФ = УсловноеОформление.Элементы.Добавить();
	ЭлементУФ.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПолей.Имя);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементУФ.Отбор, "ДеревоПолей.ПометкаУдаления", Истина);
	ЭлементУФ.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.СветлоСерый);
	//@skip-check new-font
	ЭлементУФ.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(, , , , , Истина));
	
	// Устаревшие элементы
	ЭлементУФ = УсловноеОформление.Элементы.Добавить();
	ЭлементУФ.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПолей.Имя);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементУФ.Отбор, "ДеревоПолей.ПометкаУдаления", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементУФ.Отбор, "ДеревоПолей.Устарело", Истина);
	ЭлементУФ.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.СветлоСерый);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДеревоПолей()
	
	Если Объект.ТипДанных <> Справочники.кфкТипыЗначенийСпецификации.Структура Тогда
		Возврат;
	КонецЕсли;
	
	Дерево = Справочники.кфкТипыДанныхСпецификации.ПодчинныеЭлементы(Объект.Ссылка);
	ЗначениеВДанныеФормы(Дерево, ДеревоПолей);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваРодителя()
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Родитель", Неопределено);
	Реквизиты.Вставить("ТипДанных", Неопределено);
	Реквизиты.Вставить("ОбъектКонфигурации", Неопределено);
	
	Если Не Объект.Родитель.Пустая() Тогда
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Родитель, Реквизиты);
	КонецЕсли;
	
	СвойстваРодителя = Новый ФиксированнаяСтруктура(Реквизиты);
	
КонецПроцедуры

#КонецОбласти
